mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/s6e2c2xl.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "QPRC1" -->
    <peripheral derivedFrom="QPRC0">
      <name>QPRC1</name>
      <baseAddress>0x40026040</baseAddress>
      <description>Quadrature Position/Revolution Counter 1</description>
      <version>B</version>
      <!-- INTERRUPT "QPRC1" -->
      <interrupt>
        <name>QPRC1</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "QPRC2" -->
    <peripheral derivedFrom="QPRC0">
      <name>QPRC2</name>
      <baseAddress>0x40026080</baseAddress>
      <description>Quadrature Position/Revolution Counter 2</description>
      <version>B</version>
      <!-- INTERRUPT "QPRC2" -->
      <interrupt>
        <name>QPRC2</name>
        <value>96</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "QPRC3" -->
    <peripheral derivedFrom="QPRC0">
      <name>QPRC3</name>
      <baseAddress>0x400260C0</baseAddress>
      <description>Quadrature Position/Revolution Counter 3</description>
      <version>B</version>
      <!-- INTERRUPT "QPRC3" -->
      <interrupt>
        <name>QPRC3</name>
        <value>97</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "QPRC0_NF" -->
    <peripheral>
      <name>QPRC0_NF</name>
      <description>Quadrature Position/Revolution Counter 0 Noise Filter</description>
      <version>A</version>
      <groupName>QPRC_NF</groupName>
      <baseAddress>0x40026100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "NFCTLA" -->
        <register>
          <name>NFCTLA</name>
          <description>AIN Noise Control Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AINMD" -->
            <field>
              <name>AINMD</name>
              <description>Mask bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AINLV" -->
            <field>
              <name>AINLV</name>
              <description>Input invert bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AINNWS" -->
            <field>
              <name>AINNWS</name>
              <description>Noise filter width select bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NFCTLB" -->
        <register>
          <name>NFCTLB</name>
          <description>BIN Noise Control Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BINMD" -->
            <field>
              <name>BINMD</name>
              <description>Mask bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BINLV" -->
            <field>
              <name>BINLV</name>
              <description>Input invert bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BINNWS" -->
            <field>
              <name>BINNWS</name>
              <description>Noise filter width select bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NFCTLZ" -->
        <register>
          <name>NFCTLZ</name>
          <description>ZIN Noise Control Register [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ZINMD" -->
            <field>
              <name>ZINMD</name>
              <description>Mask bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ZINLV" -->
            <field>
              <name>ZINLV</name>
              <description>Input invert bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ZINNWS" -->
            <field>
              <name>ZINNWS</name>
              <description>Noise filter width select bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "QPRC1_NF" -->
    <peripheral derivedFrom="QPRC0_NF">
      <name>QPRC1_NF</name>
      <baseAddress>0x40026110</baseAddress>
      <description>Quadrature Position/Revolution Counter 1 Noise Filter</description>
      <version>A</version>
    </peripheral>
    <!-- PERIPHERAL "QPRC2_NF" -->
    <peripheral derivedFrom="QPRC0_NF">
      <name>QPRC2_NF</name>
      <baseAddress>0x40026120</baseAddress>
      <description>Quadrature Position/Revolution Counter 2 Noise Filter</description>
      <version>A</version>
    </peripheral>
