mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/s6e2c2xl.svd
        <!-- REGISTER "ELVR1" -->
        <register>
          <name>ELVR1</name>
          <description>External Interrupt Factor Level Register 1 [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LB31" -->
            <field>
              <name>LB31</name>
              <description>External interrupt request detection level selection bit for INT31</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA31" -->
            <field>
              <name>LA31</name>
              <description>External interrupt request detection level selection bit for INT31</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB30" -->
            <field>
              <name>LB30</name>
              <description>External interrupt request detection level selection bit for INT30</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA30" -->
            <field>
              <name>LA30</name>
              <description>External interrupt request detection level selection bit for INT30</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB29" -->
            <field>
              <name>LB29</name>
              <description>External interrupt request detection level selection bit for INT29</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA29" -->
            <field>
              <name>LA29</name>
              <description>External interrupt request detection level selection bit for INT29</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB28" -->
            <field>
              <name>LB28</name>
              <description>External interrupt request detection level selection bit for INT28</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA28" -->
            <field>
              <name>LA28</name>
              <description>External interrupt request detection level selection bit for INT28</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB27" -->
            <field>
              <name>LB27</name>
              <description>External interrupt request detection level selection bit for INT27</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA27" -->
            <field>
              <name>LA27</name>
              <description>External interrupt request detection level selection bit for INT27</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB26" -->
            <field>
              <name>LB26</name>
              <description>External interrupt request detection level selection bit for INT26</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA26" -->
            <field>
              <name>LA26</name>
              <description>External interrupt request detection level selection bit for INT26</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB25" -->
            <field>
              <name>LB25</name>
              <description>External interrupt request detection level selection bit for INT25</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA25" -->
            <field>
              <name>LA25</name>
              <description>External interrupt request detection level selection bit for INT25</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB24" -->
            <field>
              <name>LB24</name>
              <description>External interrupt request detection level selection bit for INT24</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA24" -->
            <field>
              <name>LA24</name>
              <description>External interrupt request detection level selection bit for INT24</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB23" -->
            <field>
              <name>LB23</name>
              <description>External interrupt request detection level selection bit for INT23</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA23" -->
            <field>
              <name>LA23</name>
              <description>External interrupt request detection level selection bit for INT23</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB22" -->
            <field>
              <name>LB22</name>
              <description>External interrupt request detection level selection bit for INT22</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA22" -->
            <field>
              <name>LA22</name>
              <description>External interrupt request detection level selection bit for INT22</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB21" -->
            <field>
              <name>LB21</name>
              <description>External interrupt request detection level selection bit for INT21</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA21" -->
            <field>
              <name>LA21</name>
              <description>External interrupt request detection level selection bit for INT21</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB20" -->
            <field>
              <name>LB20</name>
              <description>External interrupt request detection level selection bit for INT20</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA20" -->
            <field>
              <name>LA20</name>
              <description>External interrupt request detection level selection bit for INT20</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB19" -->
            <field>
              <name>LB19</name>
              <description>External interrupt request detection level selection bit for INT19</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA19" -->
            <field>
              <name>LA19</name>
              <description>External interrupt request detection level selection bit for INT19</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB18" -->
            <field>
              <name>LB18</name>
              <description>External interrupt request detection level selection bit for INT18</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA18" -->
            <field>
              <name>LA18</name>
              <description>External interrupt request detection level selection bit for INT18</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB17" -->
            <field>
              <name>LB17</name>
              <description>External interrupt request detection level selection bit for INT17</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA17" -->
            <field>
              <name>LA17</name>
              <description>External interrupt request detection level selection bit for INT17</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB16" -->
            <field>
              <name>LB16</name>
              <description>External interrupt request detection level selection bit for INT16</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA16" -->
            <field>
              <name>LA16</name>
              <description>External interrupt request detection level selection bit for INT16</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMIRR" -->
        <register>
          <name>NMIRR</name>
          <description>Non Maskable Interrupt Factor Register [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NR" -->
            <field>
              <name>NR</name>
              <description>NMI interrupt request detection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMICL" -->
        <register>
          <name>NMICL</name>
          <description>Non Maskable Interrupt Factor Clear Register [BHW]</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NCL" -->
            <field>
              <name>NCL</name>
              <description>NMI interrupt factor clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
