mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/s6e2c2xl.svd
        <!-- REGISTER "WTTR0" -->
        <register>
          <name>WTTR0</name>
          <description>Timer Setting Register 0 [BHW]</description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM" -->
            <field>
              <name>TM</name>
              <description>Timer Setting Register</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR1" -->
        <register>
          <name>WTTR1</name>
          <description>Timer Setting Register 1 [BHW]</description>
          <addressOffset>0x50</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM" -->
            <field>
              <name>TM</name>
              <description>Timer Setting Register</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR2" -->
        <register>
          <name>WTTR2</name>
          <description>Timer Setting Register 2 [BHW]</description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM" -->
            <field>
              <name>TM</name>
              <description>Timer Setting Register</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCAL0" -->
        <register>
          <name>WTCAL0</name>
          <description>Frequency Correction Value Setting Register 0 [BHW]</description>
          <addressOffset>0x58</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCAL0" -->
            <field>
              <name>WTCAL0</name>
              <description>Frequency correction value setting bits 0</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCAL1" -->
        <register>
          <name>WTCAL1</name>
          <description>Frequency Correction Value Setting Register 1 [BHW]</description>
          <addressOffset>0x5C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCAL1" -->
            <field>
              <name>WTCAL1</name>
              <description>Frequency correction value setting bits 1</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCALEN" -->
        <register>
          <name>WTCALEN</name>
          <description>Frequency Correction Enable Register [BHW]</description>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCALEN" -->
            <field>
              <name>WTCALEN</name>
              <description>Frequency correction enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDIV" -->
        <register>
          <name>WTDIV</name>
          <description>Division Ratio Setting Register [BHW]</description>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTDIV" -->
            <field>
              <name>WTDIV</name>
              <description>Division ration setting bits</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDIVEN" -->
        <register>
          <name>WTDIVEN</name>
          <description>Divider Output Enable Register [BHW]</description>
          <addressOffset>0x68</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTDIVRDY" -->
            <field>
              <name>WTDIVRDY</name>
              <description>Divider state bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WTDIVEN" -->
            <field>
              <name>WTDIVEN</name>
              <description>Divider enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
