mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/s6e2c2xl.svd
        <!-- REGISTER "ESCLR" -->
        <register>
          <name>ESCLR</name>
          <description>Error Status Clear Register [W]</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WERRCLR" -->
            <field>
              <name>WERRCLR</name>
              <description>Write Error Clear</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AMODE" -->
        <register>
          <name>AMODE</name>
          <description>Access Mode Register [W]</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAEN" -->
            <field>
              <name>WAEN</name>
              <description>WAEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "USB0" -->
    <peripheral>
      <name>USB0</name>
      <description>USB0 Function</description>
      <version>A</version>
      <groupName>USB</groupName>
      <baseAddress>0x40040000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x2100</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2104</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2108</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x210C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2110</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2114</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2118</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x211C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2120</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2124</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2128</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x212C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2130</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2134</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2138</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x213C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2140</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2144</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2148</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x214C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2150</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2154</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2158</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x215C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2160</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2164</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2168</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x216C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2170</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2174</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "USB0_F" -->
      <interrupt>
        <name>USB0_F</name>
        <value>78</value>
      </interrupt>
      <!-- INTERRUPT "USB0_H_F" -->
      <interrupt>
        <name>USB0_H_F</name>
        <value>79</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "HCNT" -->
        <register>
          <name>HCNT</name>
          <description>Host Control Register [BHW]</description>
          <addressOffset>0x2100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SOFSTEP" -->
            <field>
              <name>SOFSTEP</name>
              <description>SOF interrupt occurrence selection bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CANCEL" -->
            <field>
              <name>CANCEL</name>
              <description>token cancellation enable bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RETRY" -->
            <field>
              <name>RETRY</name>
              <description>retry enable bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RWKIRE" -->
            <field>
              <name>RWKIRE</name>
              <description>resume interrupt enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "URIRE" -->
            <field>
              <name>URIRE</name>
              <description>bus reset interrupt enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMPIRE" -->
            <field>
              <name>CMPIRE</name>
              <description>token completion interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CNNIRE" -->
            <field>
              <name>CNNIRE</name>
              <description>device connection detection interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIRE" -->
            <field>
              <name>DIRE</name>
              <description>device disconnection detection interrupt enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFIRE" -->
            <field>
              <name>SOFIRE</name>
              <description>SOF interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "URST" -->
            <field>
              <name>URST</name>
              <description>bus reset bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HOST" -->
            <field>
              <name>HOST</name>
              <description>host mode bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HIRQ" -->
        <register>
          <name>HIRQ</name>
          <description>Host Interrupt Register [BHW]</description>
          <addressOffset>0x2104</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TCAN" -->
            <field>
              <name>TCAN</name>
              <description>token cancellation flag</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RWKIRQ" -->
            <field>
              <name>RWKIRQ</name>
              <description>remote Wake-up end flag</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "URIRQ" -->
            <field>
              <name>URIRQ</name>
              <description>bus reset end flag</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMPIRQ" -->
            <field>
              <name>CMPIRQ</name>
              <description>token completion flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CNNIRQ" -->
            <field>
              <name>CNNIRQ</name>
              <description>device connection detection flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIRQ" -->
            <field>
              <name>DIRQ</name>
              <description>device disconnection detection flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFIRQ" -->
            <field>
              <name>SOFIRQ</name>
              <description>SOF starting flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HERR" -->
        <register>
          <name>HERR</name>
          <description>Host Error Status Register [BHW]</description>
          <addressOffset>0x2105</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LSTSOF" -->
            <field>
              <name>LSTSOF</name>
              <description>lost SOF flag</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RERR" -->
            <field>
              <name>RERR</name>
              <description>receive error flag</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOUT" -->
            <field>
              <name>TOUT</name>
              <description>timeout flag</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRC" -->
            <field>
              <name>CRC</name>
              <description>CRC error flag</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TGERR" -->
            <field>
              <name>TGERR</name>
              <description>toggle error flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STUFF" -->
            <field>
              <name>STUFF</name>
              <description>stuffing error flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HS" -->
            <field>
              <name>HS</name>
              <description>handshake status flags</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSTATE" -->
        <register>
          <name>HSTATE</name>
          <description>Host Status Register [BHW]</description>
          <addressOffset>0x2108</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ALIVE" -->
            <field>
              <name>ALIVE</name>
              <description>specify the keep-alive function in the low-speed mode</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLKSEL" -->
            <field>
              <name>CLKSEL</name>
              <description>USB operation clock selection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFBUSY" -->
            <field>
              <name>SOFBUSY</name>
              <description>SOF busy flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUSP" -->
            <field>
              <name>SUSP</name>
              <description>suspend setting bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMODE" -->
            <field>
              <name>TMODE</name>
              <description>transmission mode flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CSTAT" -->
            <field>
              <name>CSTAT</name>
              <description>connection status flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HFCOMP" -->
        <register>
          <name>HFCOMP</name>
          <description>SOF Interrupt Frame Compare Register [BHW]</description>
          <addressOffset>0x2109</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRAMECOMP" -->
            <field>
              <name>FRAMECOMP</name>
              <description>frame compare data</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HRTIMER" -->
        <register>
          <name>HRTIMER</name>
          <description>Retry Timer Setup Register [BHW]</description>
          <addressOffset>0x210C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTIMER" -->
            <field>
              <name>RTIMER</name>
              <description>retry timer setting</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HRTIMER2" -->
        <register>
          <name>HRTIMER2</name>
          <description>Retry Timer Setup Register 2 [BHW]</description>
          <addressOffset>0x2110</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTIMER2" -->
            <field>
              <name>RTIMER2</name>
              <description>retry timer setting 2</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HADR" -->
        <register>
          <name>HADR</name>
          <description>Host Address Register [BHW]</description>
          <addressOffset>0x2111</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADDRESS" -->
            <field>
              <name>ADDRESS</name>
              <description>Host Address</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
