mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/s6e2c2xl.svd
        <!-- REGISTER "TXFIFO2" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO2</name>
          <description>TX-FIFO2 Register [BHW]</description>
          <addressOffset>0x58</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO3" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO3</name>
          <description>TX-FIFO3 Register [BHW]</description>
          <addressOffset>0x5C</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO4" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO4</name>
          <description>TX-FIFO4 Register [BHW]</description>
          <addressOffset>0x60</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO5" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO5</name>
          <description>TX-FIFO5 Register [BHW]</description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO6" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO6</name>
          <description>TX-FIFO6 Register [BHW]</description>
          <addressOffset>0x68</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO7" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO7</name>
          <description>TX-FIFO7 Register [BHW]</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO8" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO8</name>
          <description>TX-FIFO8 Register [BHW]</description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO9" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO9</name>
          <description>TX-FIFO9 Register [BHW]</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO10" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO10</name>
          <description>TX-FIFO10 Register [BHW]</description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO11" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO11</name>
          <description>TX-FIFO11 Register [BHW]</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO12" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO12</name>
          <description>TX-FIFO12 Register [BHW]</description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO13" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO13</name>
          <description>TX-FIFO13 Register [BHW]</description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO14" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO14</name>
          <description>TX-FIFO14 Register [BHW]</description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "TXFIFO15" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO15</name>
          <description>TX-FIFO15 Register [BHW]</description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO0" -->
        <register>
          <name>RXFIFO0</name>
          <description>RX-FIFO0 Register [BHW]</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RXDATA" -->
            <field>
              <name>RXDATA</name>
              <description>RX-FIFO0 read data</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXFIFO1" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO1</name>
          <description>RX-FIFO1 read data [BHW]</description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO2" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO2</name>
          <description>RX-FIFO2 read data [BHW]</description>
          <addressOffset>0x98</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO3" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO3</name>
          <description>RX-FIFO3 read data [BHW]</description>
          <addressOffset>0x9C</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO4" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO4</name>
          <description>RX-FIFO4 read data [BHW]</description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO5" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO5</name>
          <description>RX-FIFO5 read data [BHW]</description>
          <addressOffset>0xA4</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO6" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO6</name>
          <description>RX-FIFO6 read data [BHW]</description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO7" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO7</name>
          <description>RX-FIFO7 read data [BHW]</description>
          <addressOffset>0xAC</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO8" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO8</name>
          <description>RX-FIFO8 read data [BHW]</description>
          <addressOffset>0xB0</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO9" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO9</name>
          <description>RX-FIFO9 read data [BHW]</description>
          <addressOffset>0xB4</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO10" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO10</name>
          <description>RX-FIFO10 read data [BHW]</description>
          <addressOffset>0xB8</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO11" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO11</name>
          <description>RX-FIFO11 read data [BHW]</description>
          <addressOffset>0xBC</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO12" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO12</name>
          <description>RX-FIFO12 read data [BHW]</description>
          <addressOffset>0xC0</addressOffset>
        </register>
