mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/s6e2c2xl.svd
        <!-- REGISTER "RDCSDC1" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC1</name>
          <description>Read Command Sequence Data/Control Register 1 [BHW]</description>
          <addressOffset>0xDE</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC2" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC2</name>
          <description>Read Command Sequence Data/Control Register 2 [BHW]</description>
          <addressOffset>0xE0</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC3" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC3</name>
          <description>Read Command Sequence Data/Control Register 3 [BHW]</description>
          <addressOffset>0xE2</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC4" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC4</name>
          <description>Read Command Sequence Data/Control Register 4 [BHW]</description>
          <addressOffset>0xE4</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC5" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC5</name>
          <description>Read Command Sequence Data/Control Register 5 [BHW]</description>
          <addressOffset>0xE6</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC6" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC6</name>
          <description>Read Command Sequence Data/Control Register 6 [BHW]</description>
          <addressOffset>0xE8</addressOffset>
        </register>
        <!-- REGISTER "RDCSDC7" -->
        <register derivedFrom="RDCSDC0">
          <name>RDCSDC7</name>
          <description>Read Command Sequence Data/Control Register 7 [BHW]</description>
          <addressOffset>0xEA</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC0" -->
        <register>
          <name>WRCSDC0</name>
          <description>Write Command Sequence Data/Control Register 0 [BHW]</description>
          <addressOffset>0xEC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WRCSDATA" -->
            <field>
              <name>WRCSDATA</name>
              <description>Write command sequencer data,ontrol setting values</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONT" -->
            <field>
              <name>CONT</name>
              <description>Continuous instruction setting bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description>Serial interface width control bits</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEC" -->
            <field>
              <name>DEC</name>
              <description>Decode control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WRCSDC1" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC1</name>
          <description>Write Command Sequence Data/Control Register 1 [BHW]</description>
          <addressOffset>0xEE</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC2" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC2</name>
          <description>Write Command Sequence Data/Control Register 2 [BHW]</description>
          <addressOffset>0xF0</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC3" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC3</name>
          <description>Write Command Sequence Data/Control Register 3 [BHW]</description>
          <addressOffset>0xF2</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC4" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC4</name>
          <description>Write Command Sequence Data/Control Register 4 [BHW]</description>
          <addressOffset>0xF4</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC5" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC5</name>
          <description>Write Command Sequence Data/Control Register 5 [BHW]</description>
          <addressOffset>0xF6</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC6" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC6</name>
          <description>Write Command Sequence Data/Control Register 6 [BHW]</description>
          <addressOffset>0xF8</addressOffset>
        </register>
        <!-- REGISTER "WRCSDC7" -->
        <register derivedFrom="WRCSDC0">
          <name>WRCSDC7</name>
          <description>Write Command Sequence Data/Control Register 7 [BHW]</description>
          <addressOffset>0xFA</addressOffset>
        </register>
        <!-- REGISTER "MID" -->
        <register>
          <name>MID</name>
          <description>Module Identification Register [BHW]</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000630</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MID" -->
            <field>
              <name>MID</name>
              <description>Module identification information bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
